{
  "backend/main.mo": "Motoko backend defining shop and clothing item types, search/filter logic, item detail lookup, photo blob storage, and shop initialization.",
  "feature_evidence.json": "Feature evidence report describing requirements for adding a static clothing photo and matching backend seed data.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend source files for reference.",
  "frontend/index.css": "Global Tailwind-based style definitions using custom OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root layout and routes for category selection, search, and results.",
  "frontend/src/components/aura/AppLayout.tsx": "Root layout with header, footer, and auto backend shop initialization on mount.",
  "frontend/src/components/aura/ItemCard.tsx": "Card UI for displaying a clothing item with photo handling, metadata, price, and shop availability count.",
  "frontend/src/components/aura/ItemDetailDialog.tsx": "Modal dialog showing detailed item info, shop list, and a photo upload workflow with live preview.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing an authenticated or anonymous backend actor and refreshing dependent queries.",
  "frontend/src/hooks/useAuraQueries.ts": "Defines React Query hooks for listing categories, searching items, fetching item details, counting shop appearances, and uploading item photos via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using AuthClient, exposing identity, login, and logout handlers.",
  "frontend/src/index.css": "Sets up Tailwind CSS layers and defines light and dark theme color variables along with base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/CategorySelectionPage.tsx": "Displays available categories with icons and navigates to the search page when a category is selected.",
  "frontend/src/pages/ResultsPage.tsx": "Runs item searches based on filters, shows results or errors, and allows viewing item details or returning to search.",
  "frontend/src/pages/SearchPage.tsx": "Provides inputs for item type, color, and pattern, and navigates to results using the selected filters.",
  "frontend/src/utils/assetPaths.ts": "Normalizes image paths by cleaning input and ensuring consistent leading slashes or URL formats.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom fonts, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, goals, architecture notes, known issues, required images, and implemented features for the AURA fashion discovery app."
}