{
  "backend/main.mo": "Defines the main canister with shop, item, search, photo‑attachment logic and initialization routines.",
  "backend/migration.mo": "Migration module adding a new clothing item to a specific shop during upgrades.",
  "feature_evidence.json": "Feature evidence report describing a requirement to add a static image for a newly seeded clothing item.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend files for reference or tooling.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables and dark mode tokens.",
  "frontend/index.html": "HTML entry point containing the root div and main script loader.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with root, category, search, and results routes.",
  "frontend/src/components/aura/AppLayout.tsx": "App layout with header, footer, and backend shop initialization on mount.",
  "frontend/src/components/aura/ItemCard.tsx": "Displays a clothing item card with image, category, details, and shop availability count.",
  "frontend/src/components/aura/ItemDetailDialog.tsx": "Dialog showing item details, shop list, and photo upload functionality with live preview.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing the backend actor based on Internet Identity.",
  "frontend/src/hooks/useAuraQueries.ts": "Provides React Query hooks to list categories, search items, fetch item details and shop counts, and upload item photos via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity React context and provider handling auth client setup, identity loading, login, logout, and login status.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes and global UI styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CategorySelectionPage.tsx": "Displays selectable fashion categories with icons and navigates to the search page on selection.",
  "frontend/src/pages/ResultsPage.tsx": "Runs item searches based on filters, shows results or errors, and supports viewing item details.",
  "frontend/src/pages/SearchPage.tsx": "Provides a form for entering item-type, color, and pattern filters and navigates to the results page.",
  "frontend/src/utils/assetPaths.ts": "Normalizes photo paths, ensuring proper formatting for URLs and local asset references.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, OKLCH color tokens, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project’s state, goals, issues, and requirements for building the AURA fashion discovery app with Bangalore shop data and item photos."
}