{
  "backend/main.mo": "Motoko canister defining shop and clothing item types, search and detail queries, item photo storage, and shop/item initialization and update logic.",
  "feature_evidence.json": "Feature evidence report linking a UI update request to SearchPage.tsx and listing related components and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles in routing, UI components, hooks, styles, and utilities.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Minimal HTML bootstrap file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with three routes under AppLayout and provides the router via RouterProvider.",
  "frontend/src/components/aura/AppLayout.tsx": "Root layout with header, footer, outlet, and automatic backend shop initialization on mount.",
  "frontend/src/components/aura/ItemCard.tsx": "Item card showing photo, attributes, price, and shop count with image fallback and hover effects.",
  "frontend/src/components/aura/ItemDetailDialog.tsx": "Detailed item dialog showing full info, shop list, photo handling, and image upload with immediate preview.",
  "frontend/src/hooks/useActor.ts": "Hook creating a backend actor per-identity with query invalidation when identity changes.",
  "frontend/src/hooks/useAuraQueries.ts": "React Query hooks that call backend actor methods for listing categories, searching items, fetching item details, shop counts, and uploading photos.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login state and loading stored identities.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme CSS variables and utility rules.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CategorySelectionPage.tsx": "Page that loads categories and displays selectable cards for navigating to item search.",
  "frontend/src/pages/ResultsPage.tsx": "Displays search results for clothing items with filters, loading/error states, and item detail dialogs.",
  "frontend/src/pages/SearchPage.tsx": "Form page for entering item search filters and navigating to results based on category.",
  "frontend/src/utils/assetPaths.ts": "Utility that normalizes item photo paths into safe, consistent URLs.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, goals, issues, and feature list for building the AURA fashion discovery app with Bangalore shop data."
}